Title: Aggregates and GROUP BY
Slug: sql/aggregates-and-group-by
Category: SQL
Tags: SELECT, FROM, LIMIT, GROUP BY, sum, avg, max, min, count
Date: 2017-08-10
Modified: 2017-08-15

#### Load ipython-sql extension

In [1]:
# The 2 lines below prevent an error message from being displayed when we run %load_ext sql
import warnings
warnings.filterwarnings('ignore')

%load_ext sql
%config SqlMagic.feedback = False

#### Connect to the database

In [3]:
%%sql

postgresql://localhost/dvdrental

'Connected: None@dvdrental'

#### Sample from `film` table

In [4]:
%%sql

SELECT
    f.film_id
    , f.title
    , f.rental_rate
    , f.length
FROM
    film f
LIMIT
    5

[(133, 'Chamber Italian', Decimal('4.99'), 117),
 (384, 'Grosse Wonderful', Decimal('4.99'), 49),
 (8, 'Airport Pollock', Decimal('4.99'), 54),
 (98, 'Bright Encounters', Decimal('4.99'), 73),
 (1, 'Academy Dinosaur', Decimal('0.99'), 86)]

#### Syntax example — `sum`

In [5]:
%%sql

SELECT
    sum(f.length)
FROM
    film f

[(115272,)]

#### Other aggregate functions
**`avg`**: Mean of all column values

**`max`**: Highest value in the column

**`min`**: Lowest value in the column

**`count`**: Total number of non-null values

\*Some aggregates, including `max`, `min` and `count`, can also be applied to strings.

#### `GROUP BY`
Let's say we want to find the mean film length at each price point, and all films cost £0.99, £2.99 or £4.99.

In [6]:
%%sql

SELECT
    f.rental_rate
    , avg(f.length)
FROM
    film f
GROUP BY
    f.rental_rate

[(Decimal('4.99'), Decimal('115.8244047619047619')),
 (Decimal('0.99'), Decimal('112.9120234604105572')),
 (Decimal('2.99'), Decimal('117.1888544891640867'))]

You can group according to more than one column to drill down into your data, but make sure to add all non-aggregates to your `GROUP BY` clause.

In [7]:
%%sql

SELECT
    f.rental_rate
    , f.rating
    , avg(f.length)
FROM
    film f
GROUP BY
    f.rental_rate
    , f.rating
ORDER BY
    f.rental_rate ASC
    , f.rating ASC

[(Decimal('0.99'), 'G', Decimal('106.7187500000000000')),
 (Decimal('0.99'), 'PG', Decimal('108.3548387096774194')),
 (Decimal('0.99'), 'PG-13', Decimal('114.1111111111111111')),
 (Decimal('0.99'), 'R', Decimal('123.1857142857142857')),
 (Decimal('0.99'), 'NC-17', Decimal('111.1780821917808219')),
 (Decimal('2.99'), 'G', Decimal('113.9661016949152542')),
 (Decimal('2.99'), 'PG', Decimal('116.6562500000000000')),
 (Decimal('2.99'), 'PG-13', Decimal('123.5675675675675676')),
 (Decimal('2.99'), 'R', Decimal('116.3833333333333333')),
 (Decimal('2.99'), 'NC-17', Decimal('114.1666666666666667')),
 (Decimal('4.99'), 'G', Decimal('112.9636363636363636')),
 (Decimal('4.99'), 'PG', Decimal('110.9558823529411765')),
 (Decimal('4.99'), 'PG-13', Decimal('123.3636363636363636')),
 (Decimal('4.99'), 'R', Decimal('115.8923076923076923')),
 (Decimal('4.99'), 'NC-17', Decimal('114.4647887323943662'))]